L'idea della seguente topologia è quella di andare a gestire la First Hop Redundancy, cioè la ridondanza del default gateway.
Per farlo sarà utilizzato il protocollo HSRP, che di sua natura non permette di gestire il load balancing. Per gestire anche quest'ultimo,
la topologia è stato costruita in modo tale da prevedere due VLAN, in modo tale che il router R1 sarà attivo per la VLAN 10 ed in standby 
per la VLAN 20, e il router R2 sarà configurato per fare l'esatto opposto. Cosi facendo sia ridondanza, e quindi una maggiore faul tolerance, 
sia load balancing, vengono gestite.

1)Configurazione VLAN 10/20
SW1(config)#int range fa0/1 - 2
SW1(config-if-range)#switchport mode access 
SW1(config-if-range)#switchport access vlan 10
SW1(config)#vlan 20
-
SW2(config)#int range fa0/1 - 2
SW2(config-if-range)#switchport mode access 
SW2(config-if-range)#switchport access vlan 20
SW2(config)#vlan 10

2)Configurazione link tra switch in trunk mode
SW1(config)#int g0/1
SW1(config-if)#switchport mode trunk 
SW1(config-if)#switchport trunk allowed vlan 10,20
-
SW2(config)#int g0/1
SW2(config-if)#switchport mode trunk 
SW2(config-if)#switchport trunk allowed vlan 10,20

3)Configurazione link tra switches e routers in trunk mode
SW1(config)#int g0/2
SW1(config-if)#switchport mode trunk 
SW1(config-if)#switchport trunk allowed vlan 10,20
-
SW2(config)#int g0/2
SW2(config-if)#switchport mode trunk 
SW2(config-if)#switchport trunk allowed vlan 10,20

4)Configurazione HSRP su R1
R1(config)#int g0/2
R1(config-if)#no sh
-
R1(config)#interface gigabitEthernet0/2.10
R1(config-subif)#encapsulation dot1Q 10
R1(config-subif)#ip address 10.1.10.1 255.255.255.0
R1(config-subif)#standby 10 ip 10.1.10.10
R1(config-subif)#standby 10 priority 110
R1(config-subif)#standby 10 preempt
-
R1(config)#interface g0/2.20
R1(config-subif)#encapsulation dot1Q 20
R1(config-subif)#ip address 10.1.20.1 255.255.255.0
R1(config-subif)#standby 20 ip 10.1.20.10
R1(config-subif)#standby 20 priority 100
R1(config-subif)#standby 20 preempt

5)Configurazione HSRP su R2
R2(config)#int g0/2
R2(config-if)#no sh
-
R2(config)#int g0/2.10
R2(config-subif)#encapsulation dot1Q 10
R2(config-subif)#ip address 10.1.10.2 255.255.255.0
R2(config-subif)#standby 10 ip 10.1.10.10
R2(config-subif)#standby 10 priority 100
R2(config-subif)#standby 10 preempt
-
R2(config-subif)#int g0/2.20
R2(config-subif)#encapsulation dot1Q 20
R2(config-subif)#ip address 10.1.20.2 255.255.255.0
R2(config-subif)#standby 20 ip 10.1.20.10
R2(config-subif)#standby 20 priority 110
R2(config-subif)#standby 20 preempt


 