In questo scenario si utilizzano tre reti differenti.
Infatti considerando la notazione CIDR /30, gli indirizzi della rete 10.10.10.0 arrivano a 10.10.10.3, allo stesso modo quelli della rete 10.10.10.4 arrivano a 10.10.10.7 e cosi via

1 - Montaggio modulo porte seriali sui routers
HWIC-2T

2 - Configurazione clock rate sui router dovuta ai cavi seriali utilizzati
Router(config)#int se0/2/0
Router(config-if)#clock rate 64000
Router(config-if)#int se0/2/1
Router(config-if)#clock rate 64000
* Stessa operazione per tutti i router, che bisogna fare esclusivamente sul lato DCE del collegamento

3 - Creazione VLANs e configurazione di trunk
Switch(config)#int range fa0/1 - 2, fa0/7
Switch(config-if-range)#switchport access vlan 80
---------------------------------------------------------------
Switch(config)#int g0/1
Switch(config-if)#switchport mode trunk
* Stessa operazione per tutti gli switch di tutti i dipartimenti

4 - Configurazione IP router
Floor1-Router(config)#int serial 0/2/0
Floor1-Router(config-if)#ip address 10.10.10.5 255.255.255.252
Floor1-Router(config-if)#int s 0/2/1
Floor1-Router(config-if)#ip address 10.10.10.9 255.255.255.252
------------------------------------------------------------------
Floor2-Router(config)#int s 0/2/1
Floor2-Router(config-if)#ip address 10.10.10.10 255.255.255.252
Floor2-Router(config-if)#int s 0/2/0
Floor2-Router(config-if)#ip address 10.10.10.1 255.255.255.252
-----------------------------------------------------------------
Floor3-Router(config)#int s0/2/1
Floor3-Router(config-if)#ip address 10.10.10.2 255.255.255.252
Floor3-Router(config-if)#int s0/2/0
Floor3-Router(config-if)#ip address 10.10.10.6 255.255.255.252

5 - Inter-VLAN Routing creando le subinterfaces sulla porta collegata allo switch
L'ip di una subinterface è il default gateway per quella vlan
Subint per VLAN 80:
Floor1-Router(config)#int g0/1.80
Floor1-Router(config-subif)#encapsulation dot1Q 80
Floor1-Router(config-subif)#ip address 192.168.8.1 255.255.255.0
VLAN 70:
Floor1-Router(config-subif)#int g0/1.70
Floor1-Router(config-subif)#encapsulation dot1Q 70
Floor1-Router(config-subif)#ip address 192.168.7.1 255.255.255.0
VLAN 60:
Floor1-Router(config-subif)#int g0/1.60
Floor1-Router(config-subif)#encapsulation dot1Q 60
Floor1-Router(config-subif)#ip address 192.168.6.1 255.255.255.0
* Stessa cosa per gli altri router e di conseguenza le altre vlan

6 - Crazione DHCP pool
DHCP pool per VLAN 80
Floor1-Router(config)#ip dhcp pool Reception
Floor1-Router(dhcp-config)#network 192.168.8.0 255.255.255.0
Floor1-Router(dhcp-config)#default-router 192.168.8.1
Floor1-Router(dhcp-config)#dns-server 192.168.8.1
DHCP pool per VLAN 70
Floor1-Router(config)#ip dhcp pool Store
Floor1-Router(dhcp-config)#network 192.168.7.0 255.255.255.0
Floor1-Router(dhcp-config)#default-router 192.168.7.1
Floor1-Router(dhcp-config)#dns-server 192.168.7.1
DHCP pool per VLAN 60
Floor1-Router(config)#ip dhcp pool Logistics
Floor1-Router(dhcp-config)#network 192.168.7.0 255.255.255.0
Floor1-Router(dhcp-config)#default-router 192.168.6.1
Floor1-Router(dhcp-config)#dns-server 192.168.6.1
* Stessa cosa per gli altri router

Con la configurazione attuale, tutti i dispositivi nello stesso piano,
anche se appartenenti a vlan differenti possono comunicare.
Ma per comunicazione tra piani manca ancora qualcosa infatti,
se un dispositivo del piano 1 nella vlan 80 con ip 192.168.8.2 prova a pingare
un dispositivo del piano 3 nella vlan 20 con ip 192.168.2.2 la risposta è la seguente:
Reply from 192.168.8.1: Destination host unreachable.

Per far comunicare diverse reti si ha la necessità di configurare l'ospf

7 - Configurazione OSPF
Su ogni router andiamo a specificare tutte le reti relative alle interfacce di quel router
Floor1-Router(config)#router ospf 10
Floor1-Router(config-router)#network 10.10.10.4 255.255.255.252 area 0
Floor1-Router(config-router)#network 10.10.10.8 255.255.255.252 area 0
Floor1-Router(config-router)#network 192.168.8.0 255.255.255.0 area 0
Floor1-Router(config-router)#network 192.168.7.0 255.255.255.0 area 0
Floor1-Router(config-router)#network 192.168.6.0 255.255.255.0 area 0
---------------------------------------------------------------------
Floor2-Router(config)#router ospf 10
Floor2-Router(config-router)#network 10.10.10.0 255.255.255.252 area 0
Floor2-Router(config-router)#network 10.10.10.8 255.255.255.252 area 0
Floor2-Router(config-router)#network 192.168.3.0 255.255.255.0 area 0
Floor2-Router(config-router)#network 192.168.4.0 255.255.255.0 area 0
Floor2-Router(config-router)#network 192.168.5.0 255.255.255.0 area 0
---------------------------------------------------------------------
Floor3-Router(config)#router ospf 10
Floor3-Router(config-router)#network 10.10.10.0 255.255.255.252 area 0
Floor3-Router(config-router)#network 10.10.10.4 255.255.255.252 area 0
Floor3-Router(config-router)#network 192.168.1.0 255.255.255.0 area 0
Floor3-Router(config-router)#network 192.168.2.0 255.255.255.0 area 0

Ora TUTTI i dispositivi della rete comunicano

8 - Configurazione SSH sui router (identica alla configurazione di SSH su switch)
La prima cosa da fare è assegnare un nome di dominio, perché poi quest'ultimo
combinato con il nome del router, un Fully Qualified Domain Name che servirà 
alla generazione delle chiavi. (se il nome di dominio è carmine e il nome del router è napolitano il nome per le chiavi sarà napolitano.carmine).
Floor3-Router(config)#ip domain-name ciao
Floor3-Router(config)#username carmine password 1234
Floor3-Router(config)#crypto key generate rsa
Floor3-Router(config)#line vty 0 15
Floor3-Router(config-line)#login local
Floor3-Router(config-line)#transport input ssh

Una volta abilitato con il comando:
ssh -l "ip di una qualsiasi interfaccia o sub-int del router"
sono in grado di collegarmi da remoto










