1) Configurazione delle VLAN 10 e 20 (Switch1)
Switch(config)#int range fa0/1 - 2
Switch(config-if-range)#switchport mode access 
Switch(config-if-range)#switchport access vlan 10
Switch(config)#int range fa0/3 - 4
Switch(config-if-range)#switchport mode access 
Switch(config-if-range)#switchport access vlan 20
-
Switch(config)#int g0/1
Switch(config-if)#switchport mode trunk 
Switch(config-if)#switchport trunk allowed vlan 10,20

2) Gestione IntraRouting con ROAS (Router2)
Router(config)#int g0/1.10
Router(config-subif)#encapsulation dot1Q 10
Router(config-subif)#ip address 192.168.10.1 255.255.255.0
Router(config)#int g0/1.20
Router(config-subif)#encapsulation dot1Q 20
Router(config-subif)#ip address 192.168.20.1 255.255.255.0

3) Configurazione pool DHCP per VLAN 10 (Router2)
Router(config)#ip dhcp excluded-address 192.168.10.1 192.168.10.100 // Gli indirizzi assegnati partiranno dal .101
Router(config)#ip dhcp pool VLAN10
Router(dhcp-config)#network 192.168.10.0 255.255.255.0
Router(dhcp-config)#default-router 192.168.10.1
Router(dhcp-config)#dns-server 192.168.10.1
-
Abilitazione DHCP sugli host della VLAN 10

4) Assegnazione statica IP indirizzi per VLAN 20
PC2: IP 192.168.20.10 Default Gateway 192.168.20.1
PC3: 192.168.20.20 Default Gateway 192.168.20.1

5)Gestione Subnet 172.16.10.0/24 (Router0)
Router(config-if)#ip address 172.16.10.1 255.255.255.0
Router(config)#ip dhcp pool POOL 
Router(dhcp-config)#network 172.16.10.0 255.255.255.0
Router(dhcp-config)#default-router 172.16.10.1
Router(dhcp-config)#dns-server 172.16.10.1
-
Abilitazione DHCP sugli host

6)Gestione Subnet 172.16.20.0/24 (Router1)
Router(config-if)#ip address 172.16.20.1 255.255.255.0
Router(config-if)#ip dhcp pool POOL
Router(dhcp-config)#network 172.16.20.0 255.255.255.0
Router(dhcp-config)#default-router 172.16.20.1
Router(dhcp-config)#dns-server 172.16.20.1
-
Abilitazione DHCP su host PC6
Assegnazione statica ip al Server Web

7)Gestione clock rate interfacce seriali (l'icona dell'orologio ci suggerisce qual è il lato dce)
Router2
Router(config)#int serial0/3/0
Router(config-if)#clock rate 64000
Router0
Router(config)#int serial0/3/0
Router(config-if)#clock rate 64000
Router1
Router(config)#int serial0/3/1
Router(config-if)#clock rate 64000

8)Assegnazione IP interfacce seriali
Router2
Router(config)#int s0/3/1
Router(config-if)#ip address 10.1.1.1 255.255.255.252
Router(config-if)#no sh
Router(config-if)#int s0/3/0
Router(config-if)#ip address 10.1.1.10 255.255.255.252
Router(config-if)#no sh
Router1
Router(config)#int s0/3/0
Router(config-if)#ip address 10.1.1.9 255.255.255.252

Router(config-if)#no sh
Router(config-if)#int s0/3/1Router(config-if)#ip address 10.1.1.6 255.255.255.252
Router(config-if)#no sh
Router3
Router(config)#int s0/3/0
Router(config-if)#ip address 10.1.1.2 255.255.255.252
Router(config-if)#no sh
Router(config-if)#int s0/3/1
Router(config-if)#ip address 10.1.1.5 255.255.255.252

9)Gestione routing intra dominio con OSPF dinamico
Router2
Router(config)#router ospf 1
Router(config-router)#network 10.1.1.0 0.0.0.3 area 0
Router(config-router)#network 10.1.1.8 0.0.0.3 area 0
Router(config-router)#network 192.168.10.0 0.0.0.255 area 0
Router(config-router)#network 192.168.20.0 0.0.0.255 area 0
Router(config-router)#passive-interface g0/1
Router(config-router)#passive-interface g0/1.10
Router(config-router)#passive-interface g0/1.20
//La configurazione delle interfacce come passive è dovute al fatto che non si vuole 
//che OSPF provi a formare relazioni OSPF inviando inutilmente pacchetti OSPF Hello.
//Questo perché le interfacce sopraccitate sono collegati a dispositivi che non possono
//avere adiacenze OSPF (uno switch o un PC non potrà mai essere un neighbor di un router)
Router0
Router(config)#router ospf 1
Router(config-router)#net
Router(config-router)#network 172.16.20.0 0.0.0.255 area 0
Router(config-router)#network 10.1.1.4 0.0.0.3 area 0
Router(config-router)#network 10.1.1.8 0.0.0.3 area 0
Router(config-router)#passive-interface g0/1
Router1
Router(config)#router ospf 1
Router(config-router)#network 172.16.10.0 0.0.0.255 area 0
Router(config-router)#network 10.1.1.4 0.0.0.3 area 0
Router(config-router)#network 10.1.1.0 0.0.0.3 area 0
Router(config-router)#passive-interface g0/1

Allo stato attuale tutti riescono a comunicare con tutti e tutto il traffico è permesso.

10)Regola per far si che PC2 nella VLAN 20 non possa pingare i pc nella subnet 172.16.10.0/24
In questo caso andiamo ad utilizzare una ACL standard posta sull'interfaccia di uscita G0/1
del Router0. Il posizionamento in questo punto è dovuto al fatto che le ACL standard possono 
specificare solo IP sorgente, quindi è opportuno metterle il più vicino possibile alla destinazione,
per evitare di andare a filtrare traffico non voluto.
Router(config)#ip access-list standard NOPINGPC2
Router(config-std-nacl)#remark Blocco del traffico proveniente da PC2
Router(config-std-nacl)#deny 192.168.20.10
Router(config-std-nacl)#permit any
Router(config)#interface g0/1
Router(config-if)#ip access-group NOPINGPC2 out

11) Regola per far si che esclusivamente il PC3 non possa accedere al ServerWeb
In questo caso andiamo ad utilizzare un ACL estesa poiché quella standard non ci permetterebbe di specificare
il destinatario, e si vuole che il PC3 possa pingare il PC6. Inoltre con le ACL estese specificando il protocollo 
TCP o UDP è possibile specificare la porta sul quale il traffico non è permesso (80-443/HTTP-HTTPS). Le ACL estese 
potendo specificare l'IP di destinazione vengono messe il più vicino possibile alla sorgente, quindi nel nostro caso 
sarà l'interfaccia di entrata g0/1 del router 2.
Router(config)#ip access-list extended BLOCK_PC3_HTTP_HTTPS
Router(config-ext-nacl)#deny tcp host 192.168.20.20 host 172.16.20.200 eq 80
Router(config-ext-nacl)#deny tcp host 192.168.20.20 host 172.16.20.200 eq 443
Router(config-ext-nacl)#permit ip any any
Router(config)#int g0/1.20
Router(config-subif)#ip access-group BLOCK_PC3_HTTP_HTTPS in

