VLAN 10 - Users
172.16.10.0/24

VLAN 20 - Guest
172.16.20.0/24

VLAN 99 - Management & Native
192.168.99.0/24

1) Andiamo ad utilizzare il Router On A Stick settando le subinterfaces del router.

Router(config)#int g0/0/0.10
Router(config-subif)#encapsulation dot1Q 10
Router(config-subif)#ip address 172.16.10.1 255.255.255.0
-
Router(config-subif)#int g0/0/0.20
Router(config-subif)#encapsulation dot1Q 20
Router(config-subif)#ip address 172.16.20.1 255.255.255.0
-
Router(config-subif)#int g0/0/0.99
Router(config-subif)#encapsulation dot1Q 99 native
Router(config-subif)#ip address 172.16.99.1 255.255.255.0
-
Router(config)#int g0/0/0
Router(config-if)#no sh

2) Creazione VLAN su switch e configurazione trunk mode (g0/1 - fa0/24)

Switch(config)#vlan 10
Switch(config-vlan)#name Users
-
Switch(config-vlan)#vlan 20
Switch(config-vlan)#name Guest
-
Switch(config-vlan)#vlan 99
Switch(config-vlan)#name ManagementNative
-
Switch(config)#int g0/1
Switch(config-if)#switchport mode trunk 
Switch(config-if)#switchport trunk native vlan 99
-
Switch(config)#int g0/2
Switch(config-if)#switchport mode trunk 
Switch(config-if)#switchport trunk native vlan 99
-
Switch(config)#int fa0/24
Switch(config-if)#switchport mode trunk 
Switch(config-if)#switchport trunk native vlan 99

3) Configurazione pc nella subnet del WLC (IPv4: 192.168.1.0/28, quindi gli indirizzi della stessa subnet vanno da x.x.x.1 a x.x.x.15)
Assegnazione ip: 192.168.1.2

4) Configurazione WLC tramite accesso web browser da pc
Admin account
	user: admin
	pass: Cisco123
Management IP Address: 172.16.99.254\
Default gateway: 172.16.99.1

5) Effettuata la configurazione iniziale del WLC, il PC precedentemente collegato ad esso, viene collegato allo switch e messo nella VLAN Management
Switch(config)#int fa0/23
Switch(config-if)#switchport mode access 
Switch(config-if)#switchport access vlan 99

6)Creazione interfacce nella sezione CONTROLLER per ogni VLAN
Interface Name: INT-WLAN-10
VLAN Id: 10
-
Port Number: 1 (La porta connessa allo switch)
VLAN Identifier: 10
IP Address: 172.16.10.254
Netmask: 255.255.255.0
Gateway: 172.16.10.1
--
Interface Name: INT-WLAN-20
VLAN Id: 20
-
Port Number: 1 (La porta connessa allo switch)
VLAN Identifier: 20
IP Address: 172.16.20.254
Netmask: 255.255.255.0
Gateway: 172.16.20.1

7)Creazione WLAN 
GENERAL
Profile Name: PRO-WLAN-10
SSID: WLAN-10
Status: Enabled
Interface/Interface Group(G): INT-WLAN-10
-
SECURITY
Layer 2 Security: WPA+WPA2
WPA2 Policy: enabled
WPA2 Encryption: AES
Authentication Key Management: PSK -> Cisco456
-
ADVANCED
FlexConnect Local Switching: Enabled (Il traffico dal client wirless viene messo direttamente sulla rete al livello dell'access point senza centralizzazione verso il controller)
FlexConnect Local Auth: Enabled
-------------------------------------------
GENERAL
Profile Name: PRO-WLAN-20
SSID: WLAN-20
Status: Enabled
Interface/Interface Group(G): INT-WLAN-20
-
SECURITY
Layer 2 Security: WPA+WPA2
WPA2 Policy: enabled
WPA2 Encryption: AES
Authentication Key Management: PSK -> Cisco789
-
ADVANCED
FlexConnect Local Switching: Enabled (Il traffico dal client wirless viene messo direttamente sulla rete al livello dell'access point senza centralizzazione verso il controller)
FlexConnect Local Auth: Enabled

7)Creazione DHCP server su WLC nella sezione CONTROLLER per VLAN 99
Scope Name: DHCP-VLAN-99
Pool Start Address: 172.16.99.100
Pool End Address: 172.16.99.110
Network: 172.16.99.0
Netmask: 255.255.255.0
Default Routers: 172.16.99.1
DNS Servers: 8.8.8.8

Una volta fatto ciÃ² andiamo ad assegnare nell'interfaccia management come "Primary DHCP Server"
l'indirizzo IP del WLC siccome il pool lo abbiamo definito qui, fosse stato definito sul router, 
avremmo messo l'ip del router.
CONTROLLER > Interfaces > Management > Primary DHCP Server: 172.16.99.254

7)Creazione DHCP server su router per VLAN 10 e 20
Router(config)#ip dhcp excluded-address 172.16.10.1 172.16.10.100
Router(config)#ip dhcp excluded-address 172.16.20.1 172.16.20.100
-
Router(config)#ip dhcp pool WLAN-10
Router(dhcp-config)#network 172.16.10.0 255.255.255.0
Router(dhcp-config)#default-router 172.16.10.1
Router(dhcp-config)#dns-server 8.8.8.8
-
Router(config)#ip dhcp pool WLAN-20
Router(dhcp-config)#network 172.16.20.0 255.255.255.0
Router(dhcp-config)#default-router 172.16.20.1
Router(dhcp-config)#dns-server 8.8.8.8

Configurati i pool sul router:
CONTROLLER > Interfaces > INT-WLAN-10 > Primary DHCP Server: 172.16.10.1
CONTROLLER > Interfaces > INT-WLAN-20 > Primary DHCP Server: 172.16.20.1

8)Aggiunta di un nuovo Light Weight AP alla vlan 99
Switch(config)#int fa0/22
Switch(config-if)#switchport mode trunk 
Switch(config-if)#switchport trunk native vlan 99












