Comandi utili:
Switch#show interfaces g0/1 status
Switch#show interfaces gigabitEthernet 0/1 switchport
Switch#show interfaces trunk

1) Configurazione VLAN 10/20 su Switch
Switch(config)#int range fa0/1 - 2
Switch(config-if-range)#swit
Switch(config-if-range)#switchport mode acc
Switch(config-if-range)#switchport mode access 
Switch(config-if-range)#swit
Switch(config-if-range)#switchport access vlan 10
% Access VLAN does not exist. Creating vlan 10
Switch(config-if-range)#int range fa0/3 - 4
Switch(config-if-range)#switchport mode access 
Switch(config-if-range)#switchport access vlan 20
% Access VLAN does not exist. Creating vlan 20

2) Configurazione subinterface su router
Router(config)#int g0/1.10
Router(config-subif)#encapsulation dot1Q 10
Router(config-subif)#ip address 10.1.10.1 255.255.255.0
Router(config-subif)#int g0/1.20
Router(config-subif)#encapsulation dot1Q 20
Router(config-subif)#ip address 10.1.20.1 255.255.255.0

3) Configurazione pool dhcp
Router(config)#ip dhcp pool VLAN10
Router(dhcp-config)#network 10.1.10.0 255.255.255.0
Router(dhcp-config)#default-router 10.1.10.1
Router(dhcp-config)#dns-server 10.1.10.1
Router(dhcp-config)#exit
Router(config)#ip dhcp pool VLAN20
Router(dhcp-config)#network 10.1.20.0 255.255.255.0
Router(dhcp-config)#default-router 10.1.20.1
Router(dhcp-config)#dns-server 10.1.20.1

4) Cambio native VLAN
Switch(config-if)#switchport mode trunk 
Switch(config-if)#switchport trunk native vlan 999
Router(config)#interface g0/1.999
Router(config-subif)#encapsulation dot1Q 999 native
Router(config-subif)#ip address 10.1.30.1 255.255.255.0

FINO A QUESTO PUNTO LE VLAN COMUNICANO TRA LORO

*SE SI ELIMINA LA NATIVE VLAN, NESSUNA SARA' IN GRADO DI COMUNICARE
Switch(config-if)#switchport trunk allowed vlan remove 999
Port        Vlans allowed on trunk
Gig0/1      1-998,1000-1005
Port        Vlans allowed and active in management domain
Gig0/1      1,10,20
Port        Vlans in spanning tree forwarding state and not pruned
Gig0/1      none

5) Pruning VLAN 10 
Switch(config-if)#switchport trunk allowed vlan remove 10
Port        Vlans allowed on trunk
Gig0/1      1-9,11-1005
Port        Vlans allowed and active in management domain
Gig0/1      1,20,999
Port        Vlans in spanning tree forwarding state and not pruned
Gig0/1      1,20,999

VLAN 10 e VLAN 20 non comunicano pi√π, ma comunicano esclusivamente i pc all'interno della stessa VLAN
inoltre i PC all'interno della VLAN 10 disabilitata dal trunk non comunicano con la subint del router

